In [1]:
# 第八章 数据规整：聚合、合并和重塑


#8.1 层次化索引
import numpy as np
import pandas as pd

In [2]:
data=pd.Series(np.random.randn(9),index=[['a','a','a','b','b','c','c','d','d'],[1,2,3,1,3,1,2,2,3]])#层次化索引

In [3]:
data#一个轴上拥有多个索引级别——分层

a  1   -1.545446
   2   -1.047787
   3   -1.273961
b  1   -0.276304
   3   -0.729199
c  1    1.929853
   2    0.354254
d  2    0.774612
   3    0.288575
dtype: float64

In [4]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [5]:
pd.DataFrame(data)#DF比Series更好看

            0
a 1 -1.545446
  2 -1.047787
  3 -1.273961
b 1 -0.276304
  3 -0.729199
c 1  1.929853
  2  0.354254
d 2  0.774612
  3  0.288575

In [6]:
data['b']

1   -0.276304
3   -0.729199
dtype: float64

In [7]:
data[1]#是按默认索引选取的数据

-1.047786704333649

In [8]:
data['a',1]#先选了索引'a'，再选1，就是按照第一层索引、第二层索引取数据，不是按照默认索引了

-1.5454460436564839

In [9]:
data['b':'c']#第一层索引，从b到c

b  1   -0.276304
   3   -0.729199
c  1    1.929853
   2    0.354254
dtype: float64

In [10]:
data['b','d']#不能直接传递两个参数作为索引进行选取，解析器把字符串'b','d'作为索引了嘛？报错：KeyError: ('b', 'd')

KeyError: ('b', 'd')

In [11]:
data['b':'d']

b  1   -0.276304
   3   -0.729199
c  1    1.929853
   2    0.354254
d  2    0.774612
   3    0.288575
dtype: float64

In [12]:
data[['b','d']]#使用传递的列表从索引中选取多个

b  1   -0.276304
   3   -0.729199
d  2    0.774612
   3    0.288575
dtype: float64

In [13]:
data.loc[['b','d']]#loc方法和直接传递列表索引的效果是一致的

b  1   -0.276304
   3   -0.729199
d  2    0.774612
   3    0.288575
dtype: float64

In [14]:
data.loc[:,2]#第二层索引选取索引为2的

a   -1.047787
c    0.354254
d    0.774612
dtype: float64

In [15]:
data[:,2]#loc和不用loc的效果是一致的

a   -1.047787
c    0.354254
d    0.774612
dtype: float64

In [16]:
data#

a  1   -1.545446
   2   -1.047787
   3   -1.273961
b  1   -0.276304
   3   -0.729199
c  1    1.929853
   2    0.354254
d  2    0.774612
   3    0.288575
dtype: float64

In [17]:
data1=data.unstack()#unstack()方法可以把双层索引的Series转换为DF形式

In [18]:
data1

          1         2         3
a -1.545446 -1.047787 -1.273961
b -0.276304       NaN -0.729199
c  1.929853  0.354254       NaN
d       NaN  0.774612  0.288575

In [19]:
data1.stack()#stack()与unstack()互为逆运算

a  1   -1.545446
   2   -1.047787
   3   -1.273961
b  1   -0.276304
   3   -0.729199
c  1    1.929853
   2    0.354254
d  2    0.774612
   3    0.288575
dtype: float64

In [29]:
frame=pd.DataFrame(np.arange(12).reshape((4,3)),
                   index=[['a','a','b','b'],[1,2,1,2]],
                   columns=[['Ohio','Ohio','Colorado'],['Green','Red','Green']])
#每条轴都可以有分层索引
#有点不太好区分索引层次

In [30]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [31]:
frame.index.names=['key1','key2']#命名索引

In [32]:
frame.columns.names=['state','color']#命名列

In [33]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [34]:
frame['Ohio']#根据列索引选择列分组

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [36]:
frame['Ohio','Green']#可以先选取第一层，再选取第二层，但是显示的形式就和上边不一样了，看起来像个Series了

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: (Ohio, Green), dtype: int32

In [38]:
frame['Ohio']['Green']#可以先选取第一层，再选取第二层#注意与上述的区别

key1  key2
a     1       0
      2       3
b     1       6
      2       9
Name: Green, dtype: int32

In [39]:
type(frame['Ohio','Green'])#果然是个Series

pandas.core.series.Series

In [40]:
type(frame['Ohio'])#确实是个DF

pandas.core.frame.DataFrame

In [43]:
#单独创建多重索引，然后复用
MultiIndex.from_arrays([['Ohio','Ohio','Colorado'],['Green','Red','Green']],names=['state','color'])
#会报错，NameError: name 'MultiIndex' is not defined

NameError: name 'MultiIndex' is not defined

In [46]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [47]:
MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],names=['state', 'color'])
#直接拷贝书上的例子也不行
#?????????

NameError: name 'MultiIndex' is not defined

In [ ]:
#重排与分级排序

In [48]:
frame.swaplevel('key1','key2')#交换某条轴上各级别的顺序

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [65]:
frame.swaplevel('state','color',axis=1)#交换列轴上两个级别的顺序

color     Green  Red    Green
state      Ohio Ohio Colorado
key1 key2
a    1        0    1        2
     2        3    4        5
b    1        6    7        8
     2        9   10       11

In [49]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [53]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [60]:
frame.sort_index(level=1,ascending=False)#降序排列

state      Ohio     Colorado
color     Green Red    Green
key1 key2
b    2        9  10       11
a    2        3   4        5
b    1        6   7        8
a    1        0   1        2

In [55]:
frame.sort_index(axis=1,level=0)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [57]:
frame.sort_index(axis=1,level=1).sort_index(level=1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
b    1           8     6   7
a    2           5     3   4
b    2          11     9  10

In [58]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [61]:
frame.sort_index(axis=1,level=1,ascending=False).sort_index(level=1,ascending=False)#行轴和列轴的层级顺序都交换，降序排列

state     Ohio       Colorado
color      Red Green    Green
key1 key2
b    2      10     9       11
a    2       4     3        5
b    1       7     6        8
a    1       1     0        2

In [68]:
frame.sort_index??
#可选参数很多 
#frame.sort_index(
#    axis=0,
#    level=None,
#    ascending=True,
#    inplace=False,
#    kind='quicksort',
#    na_position='last',
#    sort_remaining=True,
#    by=None,
#)

In [69]:
frame.swaplevel(0,1).sort_index(level=0)#先交换级别再重新排序

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [ ]:
#根据级别汇总数据

In [70]:
frame.sum(level='key2')#指定按照key2的级别汇总数据（这里是求和，其他聚合函数应该都能用，如均值，中位数，方差等等）

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [71]:
frame.mean(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         3   4        5
2         6   7        8

In [73]:
frame.median(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         3   4        5
2         6   7        8

In [76]:
frame.sum(level='color',axis=1)#按指定的轴的方向进行聚合

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [74]:
frame.sum??
#可选参数很多，可以指定轴，level，等
#frame.sum(
#    axis=None,
#    skipna=None,
#    level=None,
#    numeric_only=None,
#    min_count=0,
#    **kwargs,
#)

In [ ]:
#使用DataFrame的列进行索引

In [77]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                      'c': ['one', 'one', 'one', 'two', 'two','two', 'two'], 
                      'd': [0, 1, 2, 0, 1, 2, 3]})

In [78]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [79]:
frame2=frame.set_index(['c','d'])#set_index函数将一个或多个列设置为行索引，这样原来的默认行索引就没了

In [80]:
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [83]:
frame2.reset_index()#将层次化的索引级别转换成列，是set_index的逆运算，类似于stack于unstack

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [ ]:
#8.2 合并数据集

#数据库风格的DataFrame合并

In [84]:
df1=pd.DataFrame({'key':['b','b','a','c','a','a','b'],'data1':range(7)})

In [89]:
df2=pd.DataFrame({'key':['a','b','d'],'data2':range(3)})

In [90]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [91]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [92]:
pd.merge(df1,df2)#注意key值没有c，d，且没有指定用哪个列连接，所以merge方法大致相当于sql中的 natural join

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [93]:
pd.merge??
#查看可选参数，实际上可以设置左连接右连接，默认是内连接
#pd.merge(
#    left,
#    right,
#    how='inner',
#    on=None,
#    left_on=None,
#    right_on=None,
#    left_index=False,
#    right_index=False,
#    sort=False,
#    suffixes=('_x', '_y'),
#    copy=True,
#    indicator=False,
#    validate=None,
#)

In [94]:
pd.merge(df1,df2,on='key')#指定用哪个列连接

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

In [95]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'], 'data1': range(7)})

In [96]:
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'], 'data2': range(3)})

In [97]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [98]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [99]:
pd.merge(df3,df4,left_on='lkey',right_on='rkey')#使用left_on和right_on指定用左右两个df的哪两个列进行join
#但是结果居然把这两个一样的列都显示出来了，这不科学

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [100]:
pd.merge(df1,df2,how='outer')#外连接
#可是我为什么不用sql做这些工作？

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

In [101]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [102]:
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'], 'data2': range(5)})

In [103]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [104]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [106]:
pd.merge(df1,df2,how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
5    a      2    2.0
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

In [107]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

In [108]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})

In [109]:
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

In [110]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [111]:
right

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [112]:
pd.merge(left, right, on=['key1', 'key2'], how='outer')#使用多个键进行合并，传入由列名组成的列表

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [113]:
left1= pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': [1, 2, 3]})

In [116]:
left1

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [114]:
right1= pd.DataFrame({'key11': ['foo', 'foo', 'bar', 'bar'],
                      'key22': ['one', 'one', 'one', 'two'],
                      'rval': [4, 5, 6, 7]})

In [117]:
right1

  key11 key22  rval
0   foo   one     4
1   foo   one     5
2   bar   one     6
3   bar   two     7

In [118]:
pd.merge(left1, right1, on=[['key1', 'key2'],['key11', 'key22']], how='outer')
#如果用多个列名不同的列合并，应该怎么做？on条件必须传递一个单层列表吗？
#至少可以先对列重命名，然后再用上边的方法合并

KeyError: ['key1', 'key2']

In [124]:
right1.rename(columns={'key11':'key1','key22':'key2'})#先把right1的列重命名为和left一致

  key1 key2  rval
0  foo  one     4
1  foo  one     5
2  bar  one     6
3  bar  two     7

In [125]:
pd.merge(left1, right1.rename(columns={'key11':'key1','key22':'key2'}), on=['key1', 'key2'], how='outer')
#然后再次按照两个相同的列名进行merge

  key1 key2  lval  rval
0  foo  one   1.0   4.0
1  foo  one   1.0   5.0
2  foo  two   2.0   NaN
3  bar  one   3.0   6.0
4  bar  two   NaN   7.0

In [ ]:
#索引上的合并

In [126]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],'value': range(6)})

In [127]:
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])

In [128]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [129]:
right1#索引键为a，b这一列，没有默认索引

   group_val
a        3.5
b        7.0

In [130]:
#传入left_index=True或（和）right_index=True来指定索引也作为连接键，否则索引键在merge时会被忽略
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')#指定外连接，可以获取所有的key的并集

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [132]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Ohio','Nevada', 'Nevada'], 'key2': [2000, 2001, 2002, 2001, 2002], 'data': np.arange(5.)})

In [133]:
lefth

     key1  key2  data
0    Ohio  2000   0.0
1    Ohio  2001   1.0
2    Ohio  2002   2.0
3  Nevada  2001   3.0
4  Nevada  2002   4.0

In [134]:
righth = pd.DataFrame(np.arange(12).reshape((6, 2)),
                      index=[['Nevada', 'Nevada', 'Ohio', 'Ohio','Ohio', 'Ohio'], 
                      [2001, 2000, 2000, 2000, 2001, 2002]],
                      columns=['event1', 'event2'])

In [135]:
righth

             event1  event2
Nevada 2001       0       1
       2000       2       3
Ohio   2000       4       5
       2000       6       7
       2001       8       9
       2002      10      11

In [138]:
#连接以上两个DF，由于有层次索引,需要指定有层次索引的一侧right_index=True，否则索引不参与连接，就没有名称一样的键了
#虽然righth索引没有名字，但lefth取相同值的列命名为key1，key2，会沿用
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True,how='outer')

     key1  key2  data  event1  event2
0    Ohio  2000   0.0     4.0     5.0
0    Ohio  2000   0.0     6.0     7.0
1    Ohio  2001   1.0     8.0     9.0
2    Ohio  2002   2.0    10.0    11.0
3  Nevada  2001   3.0     0.0     1.0
4  Nevada  2002   4.0     NaN     NaN
4  Nevada  2000   NaN     2.0     3.0

In [139]:
#如果两个df都有默认索引，
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [141]:
left

  key1 key2  lval
0  foo  one     1
1  foo  two     2
2  bar  one     3

In [146]:
#如果两个有默认索引的DF被指定了right_index=True, left_index=True,那么就会按默认索引来连接，可能会出现不希望的结果
#但如果DF的索引本来就是有意义的，那就会出现想要的结果
pd.merge(left1, left, right_index=True, left_index=True, how='outer')

  key  value key1 key2  lval
0   a      0  foo  one   1.0
1   b      1  foo  two   2.0
2   a      2  bar  one   3.0
3   a      3  NaN  NaN   NaN
4   b      4  NaN  NaN   NaN
5   c      5  NaN  NaN   NaN

In [147]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],index=['a', 'c', 'e'],columns=['Ohio', 'Nevada'])

In [148]:
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13, 14]],index=['b', 'c', 'd', 'e'],columns=['Missouri', 'Alabama'])

In [149]:
left2

   Ohio  Nevada
a   1.0     2.0
c   3.0     4.0
e   5.0     6.0

In [150]:
right2

   Missouri  Alabama
b       7.0      8.0
c       9.0     10.0
d      11.0     12.0
e      13.0     14.0

In [151]:
pd.merge(left2, right2, how='outer', left_index=True, right_index=True)#索引是有意义的字段，可以直接使用索引进行连接

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [152]:
#更简洁的语法，实现按索引合并
left2.join(right2,how='outer')

   Ohio  Nevada  Missouri  Alabama
a   1.0     2.0       NaN      NaN
b   NaN     NaN       7.0      8.0
c   3.0     4.0       9.0     10.0
d   NaN     NaN      11.0     12.0
e   5.0     6.0      13.0     14.0

In [153]:
#如果多个DF有相同或相似索引，且没有重叠的列，也可以使用上述方法按索引合并
right1

   group_val
a        3.5
b        7.0

In [155]:
left2.join(right2,how='outer').join(right1,how='outer')

   Ohio  Nevada  Missouri  Alabama  group_val
a   1.0     2.0       NaN      NaN        3.5
b   NaN     NaN       7.0      8.0        7.0
c   3.0     4.0       9.0     10.0        NaN
d   NaN     NaN      11.0     12.0        NaN
e   5.0     6.0      13.0     14.0        NaN

In [158]:
left2.join(right2,how='outer').join(right2.rename(columns={'Missouri':'m','Alabama':'A'}),how='outer')
#先改列再join，类似于sql中的自连接，会有一些巧妙的作用
#作为方法调用的join，默认使用左连接

   Ohio  Nevada  Missouri  Alabama     m     A
a   1.0     2.0       NaN      NaN   NaN   NaN
b   NaN     NaN       7.0      8.0   7.0   8.0
c   3.0     4.0       9.0     10.0   9.0  10.0
d   NaN     NaN      11.0     12.0  11.0  12.0
e   5.0     6.0      13.0     14.0  13.0  14.0

In [159]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],index=['a', 'c', 'e', 'f'],columns=['New York', 'Oregon'])

In [160]:
another

   New York  Oregon
a       7.0     8.0
c       9.0    10.0
e      11.0    12.0
f      16.0    17.0

In [161]:
left2.join([right2, another])#将两个DF作为列表传递给join方法，也是直接使用索引进行合并，使用左连接

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
c   3.0     4.0       9.0     10.0       9.0    10.0
e   5.0     6.0      13.0     14.0      11.0    12.0

In [164]:
left2.join([right2, another],how='outer',sort=True)#外连接，需要指定#sort=True在未来版本的pandas不再默认

   Ohio  Nevada  Missouri  Alabama  New York  Oregon
a   1.0     2.0       NaN      NaN       7.0     8.0
b   NaN     NaN       7.0      8.0       NaN     NaN
c   3.0     4.0       9.0     10.0       9.0    10.0
d   NaN     NaN      11.0     12.0       NaN     NaN
e   5.0     6.0      13.0     14.0      11.0    12.0
f   NaN     NaN       NaN      NaN      16.0    17.0

In [ ]:
#轴向连接

In [166]:
arr = np.arange(12).reshape((3, 4))

In [167]:
arr

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [168]:
np.concatenate([arr, arr], axis=1)#按行合并，以列为轴

array([[ 0,  1,  2,  3,  0,  1,  2,  3],
       [ 4,  5,  6,  7,  4,  5,  6,  7],
       [ 8,  9, 10, 11,  8,  9, 10, 11]])

In [169]:
np.concatenate([arr, arr], axis=0)#按列合并，以行为轴

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11]])

In [172]:
s1 = pd.Series([0, 1], index=['a', 'b'])

In [173]:
s2 = pd.Series([2, 3, 4], index=['c', 'd', 'e'])

In [174]:
s3 = pd.Series([5, 6], index=['f', 'g'])

In [175]:
s1

a    0
b    1
dtype: int64

In [176]:
s2

c    2
d    3
e    4
dtype: int64

In [177]:
s3

f    5
g    6
dtype: int64

In [178]:
pd.concat([s1, s2, s3])#pandas的concat方法可以将Series对象粘起来

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [180]:
pd.DataFrame(s1)

   0
a  0
b  1

In [181]:
pd.concat([pd.DataFrame(s1), pd.DataFrame(s2), pd.DataFrame(s3)])#DF对象同样可以被粘起来

   0
a  0
b  1
c  2
d  3
e  4
f  5
g  6

In [182]:
pd.concat([s1, s2, s3], axis=1)
#默认以行为轴进行粘合，也就是一行接着一行
#如果改为按列粘合，就形成一个DF对象
#这时候，行索引不同的会在不同列显示

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [183]:
s4=pd.concat([s1,s3])

In [185]:
s4

a    0
b    1
f    5
g    6
dtype: int64

In [187]:
pd.concat([s1,s4],axis=1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

     0  1
a  0.0  0
b  1.0  1
f  NaN  5
g  NaN  6

In [188]:
pd.concat([s1,s4],axis=1,join='inner')#默认左连接，传入参数join='inner'使用内连接

   0  1
a  0  0
b  1  1

In [210]:
pd.concat([s1, s4], axis=1, join_axes=[['a', 'c', 'b', 'e']])
#以列位轴（也就是在行的方向上）进行合并
#join_axes参数指定在另一个轴（也就是列）上使用的索引（也就是行的索引）

     0    1
a  0.0  0.0
c  NaN  NaN
b  1.0  1.0
e  NaN  NaN

In [189]:
result = pd.concat([s1, s1, s3], keys=['one', 'two', 'three'])
#使用key参数，指定在连接轴上创建一个层次化索引

In [190]:
result

one    a    0
       b    1
two    a    0
       b    1
three  f    5
       g    6
dtype: int64

In [192]:
type(result)

pandas.core.series.Series

In [191]:
result.unstack()#层次化索引了的SeriesF对象的unstack方法可以将之转换为DF

         a    b    f    g
one    0.0  1.0  NaN  NaN
two    0.0  1.0  NaN  NaN
three  NaN  NaN  5.0  6.0

In [193]:
pd.concat([s1,s2,s3],axis=1,keys=['one','two','three'])
#沿着axis=1合并，也就是沿着列合并，指定的keys会成为新的DF对象的列名

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   one  two  three
a  0.0  NaN    NaN
b  1.0  NaN    NaN
c  NaN  2.0    NaN
d  NaN  3.0    NaN
e  NaN  4.0    NaN
f  NaN  NaN    5.0
g  NaN  NaN    6.0

In [194]:
df1 = pd.DataFrame(np.arange(6).reshape(3, 2), index=['a', 'b', 'c'], columns=['one', 'two'])

In [195]:
df2 = pd.DataFrame(5 + np.arange(4).reshape(2, 2), index=['a', 'c'], columns=['three', 'four'])

In [196]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [197]:
df2

   three  four
a      5     6
c      7     8

In [198]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'])

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [199]:
#传入字典作为keys参数，按列轴合并，得到一个列轴上有层次索引的DF
#第一层索引为字典的key，第二层索引为key对应的DF对象的原来的列名（列索引值）
pd.concat({'level1': df1, 'level2': df2}, axis=1)

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  level1     level2
     one two  three four
a      0   1    5.0  6.0
b      2   3    NaN  NaN
c      4   5    7.0  8.0

In [200]:
pd.concat([df1, df2], axis=1, keys=['level1', 'level2'],names=['upper', 'lower'])
#用names参数为列轴的索引级别进行命名

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

upper level1     level2
lower    one two  three four
a          0   1    5.0  6.0
b          2   3    NaN  NaN
c          4   5    7.0  8.0

In [201]:
pd.concat([df1, df2], axis=0, keys=['level1', 'level2'],names=['upper', 'lower'])
#修改指定的轴，则使用keys参数可以得到行上的层次化索引，同样可以使用names对行上的层次化索引进行命名。

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

              four  one  three  two
upper  lower
level1 a       NaN  0.0    NaN  1.0
       b       NaN  2.0    NaN  3.0
       c       NaN  4.0    NaN  5.0
level2 a       6.0  NaN    5.0  NaN
       c       8.0  NaN    7.0  NaN

In [202]:
df1 = pd.DataFrame(np.random.randn(3, 4), columns=['a', 'b', 'c', 'd'])

In [203]:
df2 = pd.DataFrame(np.random.randn(2, 3), columns=['b', 'd', 'a'])

In [205]:
df1

          a         b         c         d
0  1.559464 -0.386643 -1.073140  0.333591
1 -0.184204 -0.119877 -0.781447 -0.812621
2  0.477424  0.898160 -0.220130 -1.579066

In [206]:
df2

          b         d         a
0 -0.231345 -0.217654  0.397379
1 -0.053886 -1.798759 -0.228263

In [207]:
pd.concat([df1, df2], ignore_index=True)
#对于行索引是默认整数索引的DF对象，通过传入ignore_index=True参数，为concat方法得到的结果去掉索引的影响

C:\ProgramData\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

          a         b         c         d
0  1.559464 -0.386643 -1.073140  0.333591
1 -0.184204 -0.119877 -0.781447 -0.812621
2  0.477424  0.898160 -0.220130 -1.579066
3  0.397379 -0.231345       NaN -0.217654
4 -0.228263 -0.053886       NaN -1.798759

In [ ]:
#这个实现，和sql的union有些类似的地方
#这种默认的整数索引，类似于一种魔术索引，需要的时候可以指定用它作为连接的列
#不需要的时候通过ignore_index=True参数来去掉索引带来的影响
#默认索引的这种存在，和数据库里的rownum有类似之处

In [209]:
pd.concat??
#参数说明详见该方法的代码
#pd.concat(
#    objs,
#    axis=0,
#    join='outer',
#    join_axes=None,
#    ignore_index=False,
#    keys=None,
#    levels=None,
#    names=None,
#    verify_integrity=False,
#    sort=None,
#    copy=True,
#)

In [ ]:
#合并重叠数据

In [211]:
a = pd.Series([np.nan, 2.5, np.nan, 3.5, 4.5, np.nan],index=['f', 'e', 'd', 'c', 'b', 'a'])

In [212]:
b = pd.Series(np.arange(len(a), dtype=np.float64), index=['f', 'e', 'd', 'c', 'b', 'a'])

In [213]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [214]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    5.0
dtype: float64

In [215]:
b[-1] = np.nan

In [216]:
b

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
a    NaN
dtype: float64

In [217]:
np.where(pd.isnull(a), b, a)
#where方法类似于if else
#如果a的相应索引位置isnull，则返回b的值，如果a的相应索引位置不是null，则返回a的相应位置的值
#作用上有些类似于sql的case表达式，nvl函数，orcale中的decode函数
#numpy的一些功能还不够熟悉，需要重新从头把numpy再过一次

array([0. , 2.5, 2. , 3.5, 4.5, nan])

In [218]:
np.where??

In [219]:
pd.isnull(a)

f     True
e    False
d     True
c    False
b    False
a     True
dtype: bool

In [223]:
b[:-2]#.combine_first(a[2:])

f    0.0
e    1.0
d    2.0
c    3.0
dtype: float64

In [224]:
a[2:]

d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [225]:
b[:-2].combine_first(a[2:])#combine_first 方法是Series对象类似于where
#逻辑是，先从b[:-2]中选，如果不存在，则从a[2:]选，如果是null呢

a    NaN
b    4.5
c    3.0
d    2.0
e    1.0
f    0.0
dtype: float64

In [226]:
type(b)

pandas.core.series.Series

In [228]:
a

f    NaN
e    2.5
d    NaN
c    3.5
b    4.5
a    NaN
dtype: float64

In [232]:
b[:-1]

f    0.0
e    1.0
d    2.0
c    3.0
b    4.0
dtype: float64

In [233]:
a.combine_first(b[:-1])#如果a的对应值是null,则从b选，如果b中没有，或者也为null，那最终就是null

a    NaN
b    4.5
c    3.5
d    2.0
e    2.5
f    0.0
dtype: float64

In [234]:
df1 = pd.DataFrame({'a': [1., np.nan, 5., np.nan],'b': [np.nan, 2., np.nan, 6.], 'c': range(2, 18, 4)})

In [235]:
df2 = pd.DataFrame({'a': [5., 4., np.nan, 3., 7.], 'b': [np.nan, 3., 4., 6., 8.]})

In [236]:
df1

     a    b   c
0  1.0  NaN   2
1  NaN  2.0   6
2  5.0  NaN  10
3  NaN  6.0  14

In [237]:
df2

     a    b
0  5.0  NaN
1  4.0  3.0
2  NaN  4.0
3  3.0  6.0
4  7.0  8.0

In [238]:
df1.combine_first(df2)
#DF对象的combine_first方法是类似的

     a    b     c
0  1.0  NaN   2.0
1  4.0  2.0   6.0
2  5.0  4.0  10.0
3  3.0  6.0  14.0
4  7.0  8.0   NaN

In [250]:
df1.combine_first??

In [251]:
#8.3 重塑和轴转向旋转

In [ ]:
#重塑层次化索引

In [252]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
.....: index=pd.Index(['Ohio', 'Colorado'], name='state'),
.....: columns=pd.Index(['one', 'two', 'three'],
.....: name='number'))

In [253]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [254]:
data.stack()

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [255]:
type(data.stack())

pandas.core.series.Series

In [256]:
result=data.stack()

In [257]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [258]:
result.unstack()#默认情况下unstack和stack操作最内层

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [259]:
result.unstack(0)#传入参数，指定分层级别的编号或名称，按指定级别进行unstack操作

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [260]:
result.unstack().T#不指定参数，通过转置，获得一样的结果

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [262]:
#可能引入缺失值
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [263]:
s1

a    0
b    1
c    2
d    3
dtype: int64

In [264]:
s2

c    4
d    5
e    6
dtype: int64

In [265]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [266]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [267]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [268]:
data2.unstack().stack()
#stack()默认会过滤缺失值，因此两个逆运算抵消后，结果不变

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [270]:
#如果不过滤缺失值
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [271]:
data2.unstack().stack(dropna=False).unstack()#

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [273]:
data2.unstack().stack(dropna=False).unstack().stack(dropna=False)#并没有出现想象中的缺失值扩散，小失望。。。。

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [ ]:
#什么情况下才会出现缺失值扩散呢？

In [274]:
df = pd.DataFrame({'left': result, 'right': result + 5},
.....: columns=pd.Index(['left', 'right'], name='side'))

In [275]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [276]:
df.unstack('state')#指定了外层索引的名称，作为旋转轴的级别，成为结果中最低级别

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [277]:
df.unstack()#作为对比，

side     left           right
number    one two three   one two three
state
Ohio        0   1     2     5   6     7
Colorado    3   4     5     8   9    10

In [297]:
df.unstack('state').stack('side')
#stack可以指定轴的名字，这会使得指定的轴名称作为次级索引出现

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7

In [298]:
df.unstack('state').stack()#作为对比

side             left  right
number state
one    Ohio         0      5
       Colorado     3      8
two    Ohio         1      6
       Colorado     4      9
three  Ohio         2      7
       Colorado     5     10

In [300]:
df.unstack('state').stack('state')#作为对比。可见，默认是使用原来的具有多层索引的列的最顶层索引的。
#这其实相当于一个三元组（state,side,number）所对应的值的显示形式
#

side             left  right
number state
one    Ohio         0      5
       Colorado     3      8
two    Ohio         1      6
       Colorado     4      9
three  Ohio         2      7
       Colorado     5     10

In [278]:
df.stack()

state     number  side
Ohio      one     left      0
                  right     5
          two     left      1
                  right     6
          three   left      2
                  right     7
Colorado  one     left      3
                  right     8
          two     left      4
                  right     9
          three   left      5
                  right    10
dtype: int32

In [279]:
type(df.stack())

pandas.core.series.Series

In [280]:
type(df.unstack('state'))

pandas.core.frame.DataFrame

In [281]:
type(df.unstack())

pandas.core.frame.DataFrame

In [288]:
type(df.unstack().unstack().unstack())

pandas.core.frame.DataFrame

In [290]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [291]:
df.unstack()

side     left           right
number    one two three   one two three
state
Ohio        0   1     2     5   6     7
Colorado    3   4     5     8   9    10

In [292]:
df.unstack().unstack()

side   number  state
left   one     Ohio         0
               Colorado     3
       two     Ohio         1
               Colorado     4
       three   Ohio         2
               Colorado     5
right  one     Ohio         5
               Colorado     8
       two     Ohio         6
               Colorado     9
       three   Ohio         7
               Colorado    10
dtype: int32

In [296]:
type(df.unstack().unstack())

pandas.core.series.Series

In [293]:
df.unstack().unstack().unstack()

state         Ohio  Colorado
side  number
left  one        0         3
      two        1         4
      three      2         5
right one        5         8
      two        6         9
      three      7        10

In [294]:
df.unstack().unstack().unstack().unstack()

state  Ohio           Colorado
number  one two three      one two three
side
left      0   1     2        3   4     5
right     5   6     7        8   9    10

In [295]:
df.unstack().unstack().unstack().unstack().unstack()

state     number  side
Ohio      one     left      0
                  right     5
          two     left      1
                  right     6
          three   left      2
                  right     7
Colorado  one     left      3
                  right     8
          two     left      4
                  right     9
          three   left      5
                  right    10
dtype: int32

In [ ]:
#将“长格式”旋转为“宽格式”

In [301]:
data = pd.read_csv('examples/macrodata.csv')

In [303]:
data.head()

,year,quarter,realgdp,realcons,realinv,realgovt,realdpi,cpi,m1,tbilrate,unemp,pop,infl,realint
0,1959.0,1.0,2710.349,1707.4,286.898,470.045,1886.9,28.98,139.7,2.82,5.8,177.146,0.00,0.00
1,1959.0,2.0,2778.801,1733.7,310.859,481.301,1919.7,29.15,141.7,3.08,5.1,177.830,2.34,0.74
2,1959.0,3.0,2775.488,1751.8,289.226,491.260,1916.4,29.35,140.5,3.82,5.3,178.657,2.74,1.09
3,1959.0,4.0,2785.204,1753.7,299.356,484.052,1931.3,29.37,140.0,4.33,5.6,179.386,0.27,4.06
4,1960.0,1.0,2847.699,1770.5,331.722,462.199,1955.5,29.54,139.6,3.50,5.2,180.007,2.31,1.19

In [304]:
periods = pd.PeriodIndex(year=data.year, quarter=data.quarter,
.....: name='date')

In [306]:
periods

PeriodIndex(['1959Q1', '1959Q2', '1959Q3', '1959Q4', '1960Q1', '1960Q2',
             '1960Q3', '1960Q4', '1961Q1', '1961Q2',
             ...
             '2007Q2', '2007Q3', '2007Q4', '2008Q1', '2008Q2', '2008Q3',
             '2008Q4', '2009Q1', '2009Q2', '2009Q3'],
            dtype='period[Q-DEC]', name='date', length=203, freq='Q-DEC')

In [305]:
columns = pd.Index(['realgdp', 'infl', 'unemp'], name='item')

In [307]:
columns

Index(['realgdp', 'infl', 'unemp'], dtype='object', name='item')

In [308]:
data = data.reindex(columns=columns)#重新索引

In [309]:
data.head()

item   realgdp  infl  unemp
0     2710.349  0.00    5.8
1     2778.801  2.34    5.1
2     2775.488  2.74    5.3
3     2785.204  0.27    5.6
4     2847.699  2.31    5.2

In [310]:
data.index = periods.to_timestamp('D', 'end')

In [312]:
data.head()

item                            realgdp  infl  unemp
date
1959-03-31 23:59:59.999999999  2710.349  0.00    5.8
1959-06-30 23:59:59.999999999  2778.801  2.34    5.1
1959-09-30 23:59:59.999999999  2775.488  2.74    5.3
1959-12-31 23:59:59.999999999  2785.204  0.27    5.6
1960-03-31 23:59:59.999999999  2847.699  2.31    5.2

In [313]:
ldata = data.stack().reset_index().rename(columns={0: 'value'})

In [315]:
ldata[:10]

                           date     item     value
0 1959-03-31 23:59:59.999999999  realgdp  2710.349
1 1959-03-31 23:59:59.999999999     infl     0.000
2 1959-03-31 23:59:59.999999999    unemp     5.800
3 1959-06-30 23:59:59.999999999  realgdp  2778.801
4 1959-06-30 23:59:59.999999999     infl     2.340
5 1959-06-30 23:59:59.999999999    unemp     5.100
6 1959-09-30 23:59:59.999999999  realgdp  2775.488
7 1959-09-30 23:59:59.999999999     infl     2.740
8 1959-09-30 23:59:59.999999999    unemp     5.300
9 1959-12-31 23:59:59.999999999  realgdp  2785.204

In [ ]:
#DF将不同的item值分别形成一列——这个效果，sql中用case表达式也能做到

In [316]:
pivoted = ldata.pivot('date', 'item', 'value')
#pivoted方法，前两个传递的值分别作为行和列的索引，，最后一个可选参数用于填充表格
#sql中也有pivoted方法

In [318]:
pivoted.head()

item                           infl   realgdp  unemp
date
1959-03-31 23:59:59.999999999  0.00  2710.349    5.8
1959-06-30 23:59:59.999999999  2.34  2778.801    5.1
1959-09-30 23:59:59.999999999  2.74  2775.488    5.3
1959-12-31 23:59:59.999999999  0.27  2785.204    5.6
1960-03-31 23:59:59.999999999  2.31  2847.699    5.2

In [321]:
#如果有两个列的数据要重塑
ldata['value2'] = np.random.randn(len(ldata))

In [322]:
ldata[:10]

                           date     item     value    value2
0 1959-03-31 23:59:59.999999999  realgdp  2710.349  0.207070
1 1959-03-31 23:59:59.999999999     infl     0.000 -0.016287
2 1959-03-31 23:59:59.999999999    unemp     5.800 -0.041674
3 1959-06-30 23:59:59.999999999  realgdp  2778.801 -1.424728
4 1959-06-30 23:59:59.999999999     infl     2.340 -0.343959
5 1959-06-30 23:59:59.999999999    unemp     5.100  0.293717
6 1959-09-30 23:59:59.999999999  realgdp  2775.488 -0.292598
7 1959-09-30 23:59:59.999999999     infl     2.740 -0.766109
8 1959-09-30 23:59:59.999999999    unemp     5.300 -0.479670
9 1959-12-31 23:59:59.999999999  realgdp  2785.204  0.382945

In [323]:
pivoted = ldata.pivot('date', 'item')

In [324]:
pivoted[:5]

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.016287  0.207070
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1 -0.343959 -1.424728
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -0.766109 -0.292598
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  1.179297  0.382945
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2  0.453998 -1.422378


item                              unemp
date
1959-03-31 23:59:59.999999999 -0.041674
1959-06-30 23:59:59.999999999  0.293717
1959-09-30 23:59:59.999999999 -0.479670
1959-12-31 23:59:59.999999999  1.736903
1960-03-31 23:59:59.999999999  1.657823

In [326]:
ldata.pivot??

In [327]:
unstacked = ldata.set_index(['date', 'item']).unstack('item')

In [328]:
unstacked[:5]
#pivot方法和使用set_index创建层次化索引并用unstack重塑的效果是一致的。
#这些效果，类似于sql里，使用case表达式，根据item的不同情况，重新显示搜索结果
#但sql搜索结果的表头没法实现这种多层索引的显示效果，但这不重要，比如可以把value和value2作为前缀加到次级索引前

                              value                    value2            \
item                           infl   realgdp unemp      infl   realgdp
date
1959-03-31 23:59:59.999999999  0.00  2710.349   5.8 -0.016287  0.207070
1959-06-30 23:59:59.999999999  2.34  2778.801   5.1 -0.343959 -1.424728
1959-09-30 23:59:59.999999999  2.74  2775.488   5.3 -0.766109 -0.292598
1959-12-31 23:59:59.999999999  0.27  2785.204   5.6  1.179297  0.382945
1960-03-31 23:59:59.999999999  2.31  2847.699   5.2  0.453998 -1.422378


item                              unemp
date
1959-03-31 23:59:59.999999999 -0.041674
1959-06-30 23:59:59.999999999  0.293717
1959-09-30 23:59:59.999999999 -0.479670
1959-12-31 23:59:59.999999999  1.736903
1960-03-31 23:59:59.999999999  1.657823

In [ ]:
#将“宽格式”旋转成“长格式”

In [329]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
.....: 'A': [1, 2, 3],
.....: 'B': [4, 5, 6],
.....: 'C': [7, 8, 9]})

In [330]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [331]:
melted = pd.melt(df, ['key'])
#使用melt转置，指明按哪一列展开，也是就是分组指标

In [332]:
melted

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6
6  foo        C      7
7  bar        C      8
8  baz        C      9

In [333]:
melted.pivot('key', 'variable', 'value')
#pivot和melt互为逆运算
#oracl中pivot的逆运算是unpivot，这个知识点其实还没掌握，要再看看sql中的相关内容

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

In [335]:
#注意上述结果没有默认索引了。
melted.pivot('key', 'variable', 'value').reset_index()
#使用reset_index()方法， 将索引作为值，然后新增默认索引

variable  key  A  B  C
0         bar  2  5  8
1         baz  3  6  9
2         foo  1  4  7

In [336]:
pd.melt(df, id_vars=['key'], value_vars=['A', 'B'])
#

   key variable  value
0  foo        A      1
1  bar        A      2
2  baz        A      3
3  foo        B      4
4  bar        B      5
5  baz        B      6

In [341]:
df

   key  A  B  C
0  foo  1  4  7
1  bar  2  5  8
2  baz  3  6  9

In [337]:
pd.melt(df, value_vars=['A', 'B', 'C'])
#value_vars参数

  variable  value
0        A      1
1        A      2
2        A      3
3        B      4
4        B      5
5        B      6
6        C      7
7        C      8
8        C      9

In [338]:
pd.melt(df, value_vars=['key', 'A', 'B'])

  variable value
0      key   foo
1      key   bar
2      key   baz
3        A     1
4        A     2
5        A     3
6        B     4
7        B     5
8        B     6

In [340]:
pd.melt??
#
#pd.melt(
#    frame,
#    id_vars=None,
#    value_vars=None,
#    var_name=None,
#    value_name='value',
#    col_level=None,
#)